### Load Pandas

In [56]:
import numpy as np
import pandas as pd

### Pandas Basic

In [57]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]],columns=['A','B','C'],index=['w','x','y','z'])

In [58]:
df

    A   B   C
w   1   2   3
x   4   5   6
y   7   8   9
z  10  11  12

In [59]:
df.head(2)

   A  B  C
w  1  2  3
x  4  5  6

In [60]:
df.tail(3)

    A   B   C
x   4   5   6
y   7   8   9
z  10  11  12

In [61]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [62]:
df.index.to_list()

['w', 'x', 'y', 'z']

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, w to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [64]:
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [65]:
df.shape

(4, 3)

In [66]:
df.size

12

In [67]:
df.nunique()

A    4
B    4
C    4
dtype: int64

In [68]:
df['A'].unique()

array([ 1,  4,  7, 10])

### Loading data from Files

In [69]:
# Loading data from csv files
coffee = pd.read_csv("./data/coffee.csv")
bios = pd.read_csv('./data/bios.csv')

In [70]:
# Loading data from paraquet files
results = pd.read_parquet('./data/results.parquet')

In [71]:
# Loading data from excel files
excel = pd.read_excel("./data/olympics-data.xlsx")

### Accessing data

In [72]:
print(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [73]:
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [74]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [75]:
coffee.tail(7)

         Day Coffee Type  Units Sold
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [83]:
coffee.sample(5,random_state=1) # Pass in random_state to make deterministic

         Day Coffee Type  Units Sold
3    Tuesday       Latte          20
7   Thursday       Latte          30
6   Thursday    Espresso          40
2    Tuesday    Espresso          30
10  Saturday    Espresso          45

In [86]:
# loc
# coffee.loc[Rows, Columns]
coffee.loc[1:3,["Day","Units Sold"]]

       Day  Units Sold
1   Monday          15
2  Tuesday          30
3  Tuesday          20

In [92]:
coffee.iloc[2:4,[0,2]]

       Day  Units Sold
2  Tuesday          30
3  Tuesday          20

In [93]:
# Some fancy stuff
coffee.index=coffee.Day

In [94]:
coffee.loc["Monday":"Wednesday"]

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25

In [96]:
coffee = pd.read_csv('./data/coffee.csv')

In [102]:
# Setting values
coffee.loc[1:3,["Units Sold"]]=10
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          35

In [106]:
# get single values (.at & .iat)
coffee.at[1,"Units Sold"]

np.int64(10)

In [108]:
coffee.iat[1,1]

'Latte'

In [115]:
# sort values
coffee.sort_values(["Units Sold"], ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          10
1      Monday       Latte          10
3     Tuesday       Latte          10

In [120]:
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[1,0])

          Day Coffee Type  Units Sold
1      Monday       Latte          10
3     Tuesday       Latte          10
2     Tuesday    Espresso          10
5   Wednesday       Latte          25
0      Monday    Espresso          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [121]:
# Iterate over dataframe using for loop
for index,row in coffee.iterrows():
    print(index)
    print(row,"\n\n\n")

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object



1
Day            Monday
Coffee Type     Latte
Units Sold         10
Name: 1, dtype: object



2
Day             Tuesday
Coffee Type    Espresso
Units Sold           10
Name: 2, dtype: object



3
Day            Tuesday
Coffee Type      Latte
Units Sold          10
Name: 3, dtype: object



4
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object



5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object



6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object



7
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object



8
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object



9
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object



10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object



11
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object



12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object



13
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object

### Filtering data

In [122]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [127]:
bios.loc[bios["height_cm"]>215]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,München (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5796,5819,Andy Campbell,1956-07-21,Melbourne,Victoria,AUS,Australia,218.0,93.0,NaN
6223,6250,Lars Hansen,1954-09-27,København (Copenhagen),Hovedstaden,DEN,Canada,216.0,105.0,NaN
6270,6298,Hu Zhangbao,1963-04-05,NaN,NaN,NaN,People's Republic of China,216.0,135.0,NaN
6409,6440,Sergey Kovalenko,1947-08-11,NaN,NaN,NaN,Soviet Union,216.0,111.0,2004-11-18
6420,6451,Jānis Krūmiņš,1930-01-30,Cēsis,Cēsu novads,LAT,Soviet Union,218.0,141.0,1994-11-20
6504,6537,Luc Longley,1969-01-19,Melbourne,Victoria,AUS,Australia,220.0,135.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
7074,7111,Paulo da Silva,1963-07-21,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
7188,7226,Vladimir Tkachenko,1957-09-20,Golovinka,Krasnodar Kray,RUS,Soviet Union,220.0,110.0,NaN
7281,7320,Stojko Vranković,1964-01-22,Drniš,Šibensko-kninska županija,CRO,Croatia Yugoslavia,217.0,115.0,NaN
7376,7416,Eurelijus Žukauskas,1973-08-22,Klaipėda,Klaipėda,LTU,Lithuania,218.0,115.0,NaN
52608,52983,Aleksey Kazakov,1976-03-18,Naberezhnye Chelny,Respublika Tatarstan,RUS,Russian Federation,217.0,102.0,NaN
82100,82753,Frédéric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
107408,108533,Peter John Ramos,1985-05-23,Fajardo,Puerto Rico,PUR,Puerto Rico,219.0,113.0,NaN
112312,113568,Stanko Barać,1986-08-13,Mostar,Hercegovačko-neretvanski kanton,BIH,Croatia,217.0,110.0,NaN
112332,113588,Andreas Glyniadakis,1981-08-26,Chania,Kriti,GRE,Greece,216.0,115.0,NaN
112337,113593,Hamed Haddadi,1985-05-19,Ahvaz,Khuzestan,IRI,Islamic Republic of Iran,218.0,110.0,NaN
118663,120400,Timofey Mozgov,1986-07-16,NaN,NaN,NaN,Russian Federation,216.0,113.0,NaN
118676,120415,Dmitry Musersky,1988-10-29,Makiïvka,Donetsk,UKR,Russian Federation,219.0,104.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN
121694,123709,Salah Mejri,1986-06-15,Jendouba,Jendouba,TUN,Tunisia,216.0,110.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
130460,133147,Li Muhao,1992-06-02,Guiyang,Guizhou,CHN,People's Republic of China,218.0,115.0,NaN
130461,133148,Zhou Qi,1996-01-16,Xinxiang,Henan,CHN,People's Republic of China,217.0,95.0,NaN
138671,142084,Ondřej Balvín,1992-09-20,Ústí nad Labem,Ústecký kraj,CZE,Czechia,216.0,107.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [131]:
bios.loc[bios["height_cm"]>220,["name","height_cm"]]

                   name  height_cm
5673     Gunther Behnke      221.0
5781     Tommy Burleson      223.0
6978    Arvydas Sabonis      223.0
89070          Yao Ming      226.0
89075    Roberto Dueñas      221.0
120266     Zhang Zhaoxu      221.0

In [139]:
# Short-hand syntax (without .loc)
bios[bios["height_cm"]>220][["name","height_cm"]]

                   name  height_cm
5673     Gunther Behnke      221.0
5781     Tommy Burleson      223.0
6978    Arvydas Sabonis      223.0
89070          Yao Ming      226.0
89075    Roberto Dueñas      221.0
120266     Zhang Zhaoxu      221.0

In [149]:
# Multiple filter conditions
bios[(bios["height_cm"]>150) & (bios["born_country"]=="IND") & (bios["born_region"]=="Andhra Pradesh")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19014,19147,Joe Antic,1931-03-13,Secunderabad,Andhra Pradesh,IND,India,168.0,59.0,2016-07-12
19085,19219,Mukesh Kumar Nandanoori,1970-04-16,Hyderabad,Andhra Pradesh,IND,India,175.0,64.0,NaN
25607,25799,Tulasidas Balaram,1936-11-30,Secunderabad,Andhra Pradesh,IND,India,171.0,56.0,2023-02-16
25617,25809,Dharmalingam Kannan,1936-07-08,Secunderabad,Andhra Pradesh,IND,India,163.0,54.0,2006-05-19
25620,25812,Youssef Khan,1937-08-05,Hyderabad,Andhra Pradesh,IND,India,172.0,56.0,2006-07-01
25642,25834,Peter Thangaraj,1935-12-24,Hyderabad,Andhra Pradesh,IND,India,190.0,85.0,2008-11-24
46816,47165,Sheila Watt,1941-01-27,Pitapuram,Andhra Pradesh,IND,Great Britain,164.0,64.0,2023-03-10
60816,61255,Ahmed Abdul Basith,1942-01-09,Hyderabad,Andhra Pradesh,IND,India,178.0,75.0,2021-01-01
106400,107497,Sharath Kamal Achanta,1982-07-12,Machilipatnam,Andhra Pradesh,IND,India,186.0,85.0,NaN
107178,108301,Sathi Geetha,1983-07-05,Martur,Andhra Pradesh,IND,India,156.0,52.0,NaN
110298,111512,Pranitha Vardhineni,1990-11-17,Kalleda,Andhra Pradesh,IND,India,155.0,67.0,NaN
116228,117613,Sania Mirza,1986-11-15,Hyderabad,Andhra Pradesh,IND,India,173.0,57.0,NaN
118538,120264,Rushmi Chakravarthi,1977-10-09,Hyderabad,Andhra Pradesh,IND,India,170.0,65.0,NaN
121855,123878,Jagadeesan Vishnuvardhan,1987-07-27,Secunderabad,Andhra Pradesh,IND,India,188.0,84.0,NaN
123480,125680,Parupalli Kashyap,1986-09-08,Hyderabad,Andhra Pradesh,IND,India,173.0,NaN,NaN
128046,130550,P. V. Sindhu,1995-07-05,Hyderabad,Andhra Pradesh,IND,India,179.0,65.0,NaN
131620,134434,B. Sumeeth Reddy,1991-09-26,Gungal,Andhra Pradesh,IND,India,182.0,64.0,NaN
131621,134435,Srikanth Kidambi,1993-02-07,Guntur,Andhra Pradesh,IND,India,178.0,66.0,NaN
131636,134452,Kynan Chenai,1991-01-29,Hyderabad,Andhra Pradesh,IND,India,200.0,85.0,NaN

In [156]:
# Filter by string conditions
bios[bios["name"].str.contains("Sindhu",case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19492,19631,Tara Singh Sindhu,1943-07-19,NaN,NaN,NaN,Malaysia,NaN,NaN,NaN
128046,130550,P. V. Sindhu,1995-07-05,Hyderabad,Andhra Pradesh,IND,India,179.0,65.0,NaN

In [158]:
# Regex syntax
bios[bios['name'].str.contains('Sindhu|Sumeeth ', case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19492,19631,Tara Singh Sindhu,1943-07-19,NaN,NaN,NaN,Malaysia,NaN,NaN,NaN
128046,130550,P. V. Sindhu,1995-07-05,Hyderabad,Andhra Pradesh,IND,India,179.0,65.0,NaN
131620,134434,B. Sumeeth Reddy,1991-09-26,Gungal,Andhra Pradesh,IND,India,182.0,64.0,NaN

In [160]:
## isin method & startswith
bios[bios['born_country'].isin(["USA", "FRA"]) & (bios['name'].str.startswith("Joe"))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
2741,2753,Joe Cunningham,1867-02-26,Aberdeen,Mississippi,USA,United States,NaN,NaN,1951-07-27
5791,5814,Joe Caldwell,1941-11-01,Texas City,Texas,USA,United States,196.0,89.0,NaN
6101,6128,Joe Fortenberry,1911-04-01,Slidell,Texas,USA,United States,203.0,84.0,1993-06-03
6379,6410,Joe Kleine,1962-01-04,Colorado Springs,Colorado,USA,United States,211.0,122.0,NaN
8624,8671,Joe Frazier,1944-01-12,Beaufort,South Carolina,USA,United States,183.0,89.0,2011-11-07
...,...,...,...,...,...,...,...,...,...,...
133440,136379,Joe Maloy,1985-12-20,Somers Point,New Jersey,USA,United States,175.0,65.0,NaN
135381,138595,Joey Steggall,2003-07-17,Annecy,Haute-Savoie,FRA,Australia,NaN,NaN,NaN
143679,147333,Joe Klecker,1996-11-16,Minneapolis,Minnesota,USA,United States,183.0,NaN,NaN
143731,147386,Joe Speer Ryan,1996-06-05,San Francisco,California,USA,United States,188.0,NaN,NaN
143775,147431,Joe Schroeder,1993-06-14,Indianapolis,Indiana,USA,United States,196.0,108.0,NaN

##### Query functions

In [163]:
bios.query('born_country=="IND" and born_city=="Hyderabad"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
281,282,S. M. Hadi,1899-08-12,Hyderabad,Andhra Pradesh,IND,India,NaN,NaN,1971-07-14
19085,19219,Mukesh Kumar Nandanoori,1970-04-16,Hyderabad,Andhra Pradesh,IND,India,175.0,64.0,NaN
25620,25812,Youssef Khan,1937-08-05,Hyderabad,Andhra Pradesh,IND,India,172.0,56.0,2006-07-01
25642,25834,Peter Thangaraj,1935-12-24,Hyderabad,Andhra Pradesh,IND,India,190.0,85.0,2008-11-24
60816,61255,Ahmed Abdul Basith,1942-01-09,Hyderabad,Andhra Pradesh,IND,India,178.0,75.0,2021-01-01
116228,117613,Sania Mirza,1986-11-15,Hyderabad,Andhra Pradesh,IND,India,173.0,57.0,NaN
118538,120264,Rushmi Chakravarthi,1977-10-09,Hyderabad,Andhra Pradesh,IND,India,170.0,65.0,NaN
123480,125680,Parupalli Kashyap,1986-09-08,Hyderabad,Andhra Pradesh,IND,India,173.0,NaN,NaN
128046,130550,P. V. Sindhu,1995-07-05,Hyderabad,Andhra Pradesh,IND,India,179.0,65.0,NaN
131636,134452,Kynan Chenai,1991-01-29,Hyderabad,Andhra Pradesh,IND,India,200.0,85.0,NaN